java/java-juc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-06 Tue 14:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Java 并发编程</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Java 并发编程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org14f3fcd">1. 线程</a>
<ul>
<li><a href="#org5e6d046">1.1. 线程状态</a></li>
<li><a href="#org0b58b57">1.2. Thread</a></li>
<li><a href="#orgfd323a7">1.3. ThreadLocal</a></li>
<li><a href="#orgb8a1b76">1.4. ThreadPoolExecutor</a></li>
</ul>
</li>
<li><a href="#org3a7d5b5">2. 死锁</a>
<ul>
<li><a href="#org0b227c2">2.1. 死锁的四个必要条件</a></li>
</ul>
</li>
<li><a href="#orgfd33a23">3. CAS</a></li>
<li><a href="#orgd961d59">4. AQS</a></li>
<li><a href="#org1d40bdf">5. 常用工具</a>
<ul>
<li><a href="#orgbe875c3">5.1. CountDownLatch &amp; CyclicBarrier</a></li>
<li><a href="#orga9f9212">5.2. ReentrantLock</a></li>
<li><a href="#orgfadd261">5.3. ConcurrentHashMap</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org14f3fcd" class="outline-2">
<h2 id="org14f3fcd"><span class="section-number-2">1</span> 线程</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5e6d046" class="outline-3">
<h3 id="org5e6d046"><span class="section-number-3">1.1</span> 线程状态</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>NEW</li>
<li>RUNNALBE</li>
<li>BLOCKED</li>
<li>WAITING</li>
<li>TIMED<sub>WAINTING</sub></li>
<li>TERMINATED</li>
</ol>
</div>
</div>
<div id="outline-container-org0b58b57" class="outline-3">
<h3 id="org0b58b57"><span class="section-number-3">1.2</span> Thread</h3>
</div>

<div id="outline-container-orgfd323a7" class="outline-3">
<h3 id="orgfd323a7"><span class="section-number-3">1.3</span> ThreadLocal</h3>
</div>

<div id="outline-container-orgb8a1b76" class="outline-3">
<h3 id="orgb8a1b76"><span class="section-number-3">1.4</span> ThreadPoolExecutor</h3>
</div>
</div>

<div id="outline-container-org3a7d5b5" class="outline-2">
<h2 id="org3a7d5b5"><span class="section-number-2">2</span> 死锁</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0b227c2" class="outline-3">
<h3 id="org0b227c2"><span class="section-number-3">2.1</span> 死锁的四个必要条件</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><code>互斥条件</code>: 一个资源每次只能被一个进程使用</li>
<li><code>请求与保持条件</code>: 一个进程因请求资源而阻塞时，对已获得的资源保持不放</li>
<li><code>不剥夺条件</code>: 进程已获得的资源，在末使用完之前，不能强行剥夺</li>
<li><code>循环等待条件</code>: 若干进程之间形成一种头尾相接的循环等待资源关系</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgfd33a23" class="outline-2">
<h2 id="orgfd33a23"><span class="section-number-2">3</span> CAS</h2>
</div>

<div id="outline-container-orgd961d59" class="outline-2">
<h2 id="orgd961d59"><span class="section-number-2">4</span> AQS</h2>
</div>

<div id="outline-container-org1d40bdf" class="outline-2">
<h2 id="org1d40bdf"><span class="section-number-2">5</span> 常用工具</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgbe875c3" class="outline-3">
<h3 id="orgbe875c3"><span class="section-number-3">5.1</span> CountDownLatch &amp; CyclicBarrier</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">private</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">doWork</span><span style="color: #8d5649;">()</span> <span style="color: #8d5649;">{</span>
  <span style="color: #859900;">try</span> <span style="color: #d8241f;">{</span>
    Thread.sleep<span style="color: #9564bf;">(</span><span style="color: #859900;">new</span> <span style="color: #268bd2;">Double</span><span style="color: #24a222;">(</span>Math.random<span style="color: #ff7f00;">()</span> * 3000<span style="color: #24a222;">)</span>.longValue<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span> <span style="color: #859900;">catch</span> <span style="color: #d8241f;">(</span><span style="color: #268bd2;">InterruptedException</span> <span style="color: #6c71c4;">e</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    e.printStackTrace<span style="color: #9564bf;">()</span>;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>

<span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">test01</span><span style="color: #8d5649;">()</span> <span style="color: #859900;">throws</span> <span style="color: #268bd2;">InterruptedException</span> <span style="color: #8d5649;">{</span>
  <span style="color: #268bd2;">CountDownLatch</span> <span style="color: #6c71c4;">countDownLatch</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">CountDownLatch</span><span style="color: #d8241f;">(</span>5<span style="color: #d8241f;">)</span>;
  <span style="color: #859900;">for</span> <span style="color: #d8241f;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; 5; i++<span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #268bd2;">Thread</span> <span style="color: #6c71c4;">t</span> =
        <span style="color: #859900;">new</span> <span style="color: #268bd2;">Thread</span><span style="color: #9564bf;">(</span>
            <span style="color: #24a222;">()</span> -&gt; <span style="color: #24a222;">{</span>
              doWork<span style="color: #ff7f00;">()</span>;
              countDownLatch.countDown<span style="color: #ff7f00;">()</span>; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#19981;&#38459;&#22622;</span>
              System.out.printf<span style="color: #ff7f00;">(</span><span style="color: #2aa198;">"&#29609;&#23478;[%s]&#20934;&#22791;&#23601;&#32490;\n"</span>, Thread.currentThread<span style="color: #1776b6;">()</span>.getName<span style="color: #1776b6;">()</span><span style="color: #ff7f00;">)</span>;
            <span style="color: #24a222;">}</span><span style="color: #9564bf;">)</span>;
    t.start<span style="color: #9564bf;">()</span>;
  <span style="color: #d8241f;">}</span>
  countDownLatch.await<span style="color: #d8241f;">()</span>; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#38459;&#22622;</span>
  System.out.println<span style="color: #d8241f;">(</span><span style="color: #2aa198;">"&#28216;&#25103;&#24320;&#22987;"</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>

<span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">test02</span><span style="color: #8d5649;">()</span> <span style="color: #859900;">throws</span> <span style="color: #268bd2;">InterruptedException</span> <span style="color: #8d5649;">{</span>
  <span style="color: #268bd2;">CyclicBarrier</span> <span style="color: #6c71c4;">cyclicBarrier</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">CyclicBarrier</span><span style="color: #d8241f;">(</span>5<span style="color: #d8241f;">)</span>;
  <span style="color: #859900;">for</span> <span style="color: #d8241f;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; 10; i++<span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #268bd2;">Thread</span> <span style="color: #6c71c4;">t</span> =
        <span style="color: #859900;">new</span> <span style="color: #268bd2;">Thread</span><span style="color: #9564bf;">(</span>
            <span style="color: #24a222;">()</span> -&gt; <span style="color: #24a222;">{</span>
              doWork<span style="color: #ff7f00;">()</span>;
              <span style="color: #859900;">try</span> <span style="color: #ff7f00;">{</span>
                System.out.printf<span style="color: #1776b6;">(</span><span style="color: #2aa198;">"&#29609;&#23478;[%s]&#36873;&#25321;&#33521;&#38596;\n"</span>, Thread.currentThread<span style="color: #00bed1;">()</span>.getName<span style="color: #00bed1;">()</span><span style="color: #1776b6;">)</span>;
                cyclicBarrier.await<span style="color: #1776b6;">()</span>; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#19981;&#38459;&#22622;&#65292;&#36798;&#21040;&#24490;&#29615;&#25968;&#23383;&#26102;&#25152;&#26377;&#32447;&#31243;&#21516;&#26102;&#21796;&#37266;&#65292;&#24182;&#24490;&#29615;&#21033;&#29992;</span>
                System.out.printf<span style="color: #1776b6;">(</span><span style="color: #2aa198;">"&#29609;&#23478;[%s]&#20934;&#22791;&#23601;&#32490;\n"</span>, Thread.currentThread<span style="color: #00bed1;">()</span>.getName<span style="color: #00bed1;">()</span><span style="color: #1776b6;">)</span>;
              <span style="color: #ff7f00;">}</span> <span style="color: #859900;">catch</span> <span style="color: #ff7f00;">(</span>InterruptedException | BrokenBarrierException e<span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                e.printStackTrace<span style="color: #1776b6;">()</span>;
              <span style="color: #ff7f00;">}</span>
            <span style="color: #24a222;">}</span><span style="color: #9564bf;">)</span>;
    t.start<span style="color: #9564bf;">()</span>;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orga9f9212" class="outline-3">
<h3 id="orga9f9212"><span class="section-number-3">5.2</span> ReentrantLock</h3>
</div>

<div id="outline-container-orgfadd261" class="outline-3">
<h3 id="orgfadd261"><span class="section-number-3">5.3</span> ConcurrentHashMap</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-07-06 Tue 14:37. Created by Jinghui Hu at 2021-06-21 Mon 22:27.</p>
</div>
</body>
</html>
